src/cf/InformationRegisters/ПредметыИУчастникиДействийКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПредметыИУчастникиДействийКомплексныхПроцессов</Name>
			<Comment>Используется для хранения участников действий комплексных процессов для проверки прав. После запуска действия записи с его участниками удаляются.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплексныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПредмета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьШаблоныСоставныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьШаблоныПоручения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПараметрыСхемДляКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПараметрыСхемДляКомплексныхПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецСхемы</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
								<v8:Type>cfg:CatalogRef.СкриптыСхемДляКомплексныхПроцессов</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаХранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/МультипредметностьКОРП/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Мультипредметность"
// Модуль МультипредметностьКОРП: сервер, внешнее соединение
//
// Содержит процедуры и функции обработки объектов и механизмов, 
// поддерживающих мультипредметность в редакциях КОРП/ДГУ.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс_ПроверкаПравНаПредметы

// Проверяет права участников процессов на предметы.
// В случае отсутствия прав, отправляет уведомление автору процессу.
//
// Параметры:
//  ПроцессОбъект - БизнесПроцессОбъект - процесс.
//  АвторПроцесса - СправочникСсылка.Сотрудники,
//                  СправочникСсылка.Пользователи - автор процесса.
//
Процедура ПроверитьПраваУчастниковПроцессаИОтправитьУведомления(ПроцессОбъект, АвторПроцесса) Экспорт
	
	Отказ = Ложь;
	ПроцессОбъект.ПроверитьПраваУчастниковПроцессаНаПредметы(ПроцессОбъект, Отказ, Ложь);
	
	Если Отказ Тогда
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		
		ТекстУведомления = НСтр("ru = 'Не все участники процесса имеют права на предметы:
			|%1'");
			
		ТекстСообщений = "";
		Разделитель = "";
			
		Для Каждого Сообщение Из Сообщения Цикл
			ТекстСообщений = ТекстСообщений
				+ Разделитель
				+ Сообщение.Текст;
				
			Разделитель = "" + Символы.ПС + Символы.ПС;
		КонецЦикла;
		
		ТекстУведомления = СтрШаблон(ТекстУведомления, ТекстСообщений);
		
		РаботаСУведомлениями.ОбработатьУведомлениеПрограммы(
			ТекстУведомления,
			Сотрудники.ПользовательСотрудника(АвторПроцесса),
			ПроцессОбъект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет данные действия в регистре сведений ПредметыИУчастникиДействийКомплексныхПроцессов.
//
// Параметры:
//  Действие - СправочникОбъект.<ИмяШаблонаПроцесса>
//             СправочникСсылка.<ИмяШаблонаПроцесса> - действие комплексного процесса.
//
Процедура ОбновитьКэшПредметовИУчастниковДействияКомплексныхПроцессов(Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Действие)) Тогда
		РеквизитыДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Действие, "ПометкаУдаления, ВладелецШаблона, КомплексныйПроцесс, Ссылка");
	Иначе
		РеквизитыДействия = Действие;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДействия.КомплексныйПроцесс) Тогда
		Возврат;
	КонецЕсли;
	
	Если РеквизитыДействия.ПометкаУдаления Тогда
		
		ДобавитьЗаписиПоДействию = Ложь;
		
	ИначеЕсли Не ОбщегоНазначения.СсылкаСуществует(РеквизитыДействия.КомплексныйПроцесс) Тогда
		
		ДобавитьЗаписиПоДействию = Истина;
		
	Иначе
		
		ДобавитьЗаписиПоДействию = Ложь;
		
		ТекущееДействие = РеквизитыДействия.Ссылка;
		ТекущийВладелец = РеквизитыДействия.ВладелецШаблона;
		Пока ТекущийВладелец <> РеквизитыДействия.КомплексныйПроцесс Цикл
			ТекущееДействие = ТекущийВладелец;
			ТекущийВладелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийВладелец, "ВладелецШаблона");
		КонецЦикла;
		
		Схема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			РеквизитыДействия.КомплексныйПроцесс, "Схема");
		
		Если ЗначениеЗаполнено(Схема) Тогда
						
			ПараметрыСхемы = 
				Справочники.ПараметрыСхемДляКомплексныхПроцессов.ПараметрыПоСхеме(Схема);
			
			Если ЗначениеЗаполнено(ПараметрыСхемы) Тогда
				
				ТипТекущегоДействия = ТипЗнч(ТекущееДействие);
				
				ДанныеПараметров = 
					Справочники.ПараметрыСхемДляКомплексныхПроцессов.ДанныеПараметровСхемы(
					ПараметрыСхемы);
					
				ПроцессыЭлементов = РаботаСКомплекснымиБизнесПроцессамиСервер.
					ПроцессыЭлементовСхемыПоКомплексномуПроцессу(
					РеквизитыДействия.КомплексныйПроцесс);
				
				ИмяЭлемента = "";
				Для Каждого ИмяЭлементаИНастройка Из ДанныеПараметров.НастройкиЭлементов Цикл
					НастрокаЭлемента = ИмяЭлементаИНастройка.Значение;
					Если ТипЗнч(НастрокаЭлемента) = ТипТекущегоДействия
						И НастрокаЭлемента = ТекущееДействие Тогда
						
						ИмяЭлемента = ИмяЭлементаИНастройка.Ключ;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(ПроцессыЭлементов[ИмяЭлемента]) Тогда
					ДобавитьЗаписиПоДействию = Истина;
				КонецЕсли;
							
			КонецЕсли;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КомплексныйПроцессЭтапы.ЗапущенныйБизнесПроцесс
				|ИЗ
				|	БизнесПроцесс.КомплексныйПроцесс.Этапы КАК КомплексныйПроцессЭтапы
				|ГДЕ
				|	КомплексныйПроцессЭтапы.ШаблонБизнесПроцесса = &ШаблонБизнесПроцесса
				|	И КомплексныйПроцессЭтапы.Ссылка = &КомплексныйПроцесс";
			Запрос.УстановитьПараметр("ШаблонБизнесПроцесса", ТекущееДействие);
			Запрос.УстановитьПараметр("КомплексныйПроцесс", РеквизитыДействия.КомплексныйПроцесс);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() = 0
				Или Выборка.Следующий()
					И Не ЗначениеЗаполнено(Выборка.ЗапущенныйБизнесПроцесс) Тогда
				
				ДобавитьЗаписиПоДействию = Истина;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДобавитьЗаписиПоДействию Тогда
		РегистрыСведений.ПредметыИУчастникиДействийКомплексныхПроцессов.
			ДобавитьЗаписиПоДействию(Действие);
	Иначе
		РегистрыСведений.ПредметыИУчастникиДействийКомплексныхПроцессов.
			УдалитьЗаписиДействия(РеквизитыДействия.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет данные действия комплексного процесса из регистра сведений ПредметыИУчастникиДействийКомплексныхПроцессов.
//
// Параметры:
//  Действие - СправочникСсылка.<ИмяШаблонаПроцесса> - действие комплексного процесса.
//
Процедура УдалитьДействиеКомплексногоПроцессаИзКэшаПредметовИУчастников(Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ПредметыИУчастникиДействийКомплексныхПроцессов.УдалитьЗаписиДействия(Действие);
	
	Если ТипЗнч(Действие) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
		
		ПодчиненныеДействия = Новый Массив;
		
		ПолучитьДействияКомплексногоПроцесса(Действие, ПодчиненныеДействия);
		
		Для Каждого ПодчиненноеДействие Из ПодчиненныеДействия Цикл
			РегистрыСведений.ПредметыИУчастникиДействийКомплексныхПроцессов.
				УдалитьЗаписиДействия(ПодчиненноеДействие);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ПроверкаПравНаПредметы

// Обработчик подписки ОбновлениеПредметовИУчастниковДействийКомплексногоПроцесса
//
Процедура ОбновлениеПредметовИУчастниковДействийКомплексногоПроцессаПриЗаписи(
	Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(Источник.ИсточникДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ВидЗаписи")
		И Источник.ДополнительныеСвойства.ВидЗаписи <>
			"ЗаписьСЗаполнениемСлужебныхРеквизитовКомплексныхПроцессов" Тогда
		
		Возврат;
	КонецЕсли;
	
	ОбновитьКэшПредметовИУчастниковДействияКомплексныхПроцессов(Источник);
	
КонецПроцедуры

// Помещает все действия комплексного процесса в массив.
// Рекурсивная процедура.
//
// Параметры:
//  КомплексныйПроцесс - СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов - комплексный процесс.
//  Действия - Массив
//   * СправочникСсылка.<ИмяШаблонаПроцесса> - действие комплексного процесса. В этот параметр является результатом
//                                             выполнения процедуры.
//
Процедура ПолучитьДействияКомплексногоПроцесса(КомплексныйПроцесс, Действия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Схема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КомплексныйПроцесс, "Схема");
	
	Если ЗначениеЗаполнено(Схема) Тогда
		
		ПараметрыСхемы = Справочники.ПараметрыСхемДляКомплексныхПроцессов.ПараметрыПоСхеме(Схема);
		
		Если ЗначениеЗаполнено(ПараметрыСхемы) Тогда
			ДанныеПараметров = 
				Справочники.ПараметрыСхемДляКомплексныхПроцессов.ДанныеПараметровСхемы(
				ПараметрыСхемы);
			
			НастройкиЭлементов = РаботаСКомплекснымиБизнесПроцессамиСервер.
				НастройкиДействийИВложенныхПроцессовВДанныхПараметров(ДанныеПараметров);
				
			Для Каждого НастройкаЭлемента Из НастройкиЭлементов Цикл
				
				Действия.Добавить(НастройкаЭлемента);
			
				Если ТипЗнч(НастройкаЭлемента) =
					Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
					
					ПолучитьДействияКомплексногоПроцесса(НастройкаЭлемента, Действия);
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
			
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ШаблоныКомплексныхБизнесПроцессовЭтапы.ШаблонБизнесПроцесса
			|ИЗ
			|	Справочник.ШаблоныКомплексныхБизнесПроцессов.Этапы КАК ШаблоныКомплексныхБизнесПроцессовЭтапы
			|ГДЕ
			|	ШаблоныКомплексныхБизнесПроцессовЭтапы.Ссылка = &КомплексныйПроцесс";
		Запрос.УстановитьПараметр("КомплексныйПроцесс", КомплексныйПроцесс);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.ШаблонБизнесПроцесса) Тогда
				Продолжить;
			КонецЕсли;
			
			Действия.Добавить(Выборка.ШаблонБизнесПроцесса);
			
			Если ТипЗнч(Выборка.ШаблонБизнесПроцесса) =
				Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
				
				ПолучитьДействияКомплексногоПроцесса(Выборка.ШаблонБизнесПроцесса, Действия);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
